Revit 2027 API
ExternalServices.BuiltInExternalServices.FramingProfileService Property
 The external service responsible for the generation of the fabrication profile.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId FramingProfileService { get; }
Public Shared ReadOnly Property FramingProfileService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ FramingProfileService {
	ExternalServiceId^ get ();
}
static member FramingProfileService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace